Revit 2027 API
View3D.GetSavedOrientation Method
 Gets the saved orientation of the View3D.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewOrientation3D GetSavedOrientation()
Public Function GetSavedOrientation As ViewOrientation3D
public:
ViewOrientation3D^ GetSavedOrientation()
member GetSavedOrientation : unit -> ViewOrientation3D
Return Value
ViewOrientation3D
 The saved orientation of the View3D.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace